In [20]:
import pandas as pd

In [21]:
df=pd.read_csv("c.csv")

In [22]:
df.info

<bound method DataFrame.info of    Class  Marks
0   2010     87
1   2011     85
2   2012     89
3   2013     89
4   2014     86
5   2015     82
6   2016     93
7   2017     92
8   2018     93
9   2019     92>

In [23]:
df.tail(2)

   Class  Marks
8   2018     93
9   2019     92

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Class   10 non-null     int64
 1   Marks   10 non-null     int64
dtypes: int64(2)
memory usage: 292.0 bytes

In [25]:
df

   Class  Marks
0   2010     87
1   2011     85
2   2012     89
3   2013     89
4   2014     86
5   2015     82
6   2016     93
7   2017     92
8   2018     93
9   2019     92

In [26]:
df.dropna()

   Class  Marks
0   2010     87
1   2011     85
2   2012     89
3   2013     89
4   2014     86
5   2015     82
6   2016     93
7   2017     92
8   2018     93
9   2019     92

df1 = df.dropna()

In [15]:
df['Marks'].mean()

88.8

In [16]:
df['Marks'].median()

89.0

In [17]:
df['Marks'].mode()

0    89
1    92
2    93
Name: Marks, dtype: int64

In [28]:
df.fillna(df['Marks'].median(), inplace=True)

In [29]:
df

   Class  Marks
0   2010     87
1   2011     85
2   2012     89
3   2013     89
4   2014     86
5   2015     82
6   2016     93
7   2017     92
8   2018     93
9   2019     92

In [33]:
print(df.duplicated())

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
dtype: bool